In [8]:
import pandas as pd

#SERIES

#months
mon=['JANUARY','FEBRUARY','MARCH','APRIL','MAY','JUNE','JULY','AUGUST','SEPTEMBER','OCT','NOV','DEC']
sales=[233,21,22,25,66,77,33,55,888,43,11,12]
ser=pd.Series(sales,index=mon,name="sales per month",dtype='int')
print(ser)

JANUARY      233
FEBRUARY      21
MARCH         22
APRIL         25
MAY           66
JUNE          77
JULY          33
AUGUST        55
SEPTEMBER    888
OCT           43
NOV           11
DEC           12
Name: sales per month, dtype: int64

In [9]:
data={'name':['alice','bob','charlie','david'],
      'age':[25,22,34,35],
      'cty':['nyc','la','chicago','houston']
     }
df=pd.DataFrame(data)
print(df)

      name  age      cty
0    alice   25      nyc
1      bob   22       la
2  charlie   34  chicago
3    david   35  houston

In [16]:
data={'name':['alice','bob','charlie','david'],
      'age':[25,22,34,35],
     }
df=pd.DataFrame(data)
print("before addding")
print(df)
df[ 'cty']=['nyc','la','chicago','houston']
print("after")
print(df)

before addding
      name  age
0    alice   25
1      bob   22
2  charlie   34
3    david   35
after
      name  age      cty
0    alice   25      nyc
1      bob   22       la
2  charlie   34  chicago
3    david   35  houston

In [19]:
data={'name':['alice','bob','charlie','david'],
      'age':[25,22,34,35],
      'cty':['nyc','la','chicago','houston']
     }
df=pd.DataFrame(data)
print(df)

#new columns to be added
newcol={'gender':['f','m','f','m'],'grade':['a','b','a','c']}
df['gender']=newcol['gender']
df['grade']=newcol['grade']
print(df)

#inserting column using insert function 
df.insert(2,'marks',[24,23,25,21])
print(df)

      name  age      cty
0    alice   25      nyc
1      bob   22       la
2  charlie   34  chicago
3    david   35  houston
      name  age      cty gender grade
0    alice   25      nyc      f     a
1      bob   22       la      m     b
2  charlie   34  chicago      f     a
3    david   35  houston      m     c
      name  age  marks      cty gender grade
0    alice   25     24      nyc      f     a
1      bob   22     23       la      m     b
2  charlie   34     25  chicago      f     a
3    david   35     21  houston      m     c

In [22]:
data={'name':['alice','bob','charlie','david'],
      'age':[25,22,34,35],
      'cty':['nyc','la','chicago','houston']
     }
df=pd.DataFrame(data)
print("initial df")
print(df)

#adding new row to the df

row=pd.DataFrame([{'name':'shreyaaaa','age':'sweet21','cty':'Karachi'}])
print(row)

# adding row

df=pd.concat([df,row],ignore_index=True)

print(df)

initial df
      name  age      cty
0    alice   25      nyc
1      bob   22       la
2  charlie   34  chicago
3    david   35  houston
        name      age      cty
0  shreyaaaa  sweet21  Karachi
        name      age      cty
0      alice       25      nyc
1        bob       22       la
2    charlie       34  chicago
3      david       35  houston
4  shreyaaaa  sweet21  Karachi

In [26]:
data={'name':['yahika','shreya','charlie','david'],
      'age':[25,22,34,35],
      'cty':['nyc','la','chicago','houston']
     }
df=pd.DataFrame(data)
print("initial df")
print(df)


row={'name':'shreyaaaa','age':21,'cty':'Karachi'}

inx=3

df.loc[inx]=row
print(df)

initial df
      name  age      cty
0   yahika   25      nyc
1   shreya   22       la
2  charlie   34  chicago
3    david   35  houston
        name  age      cty
0     yahika   25      nyc
1     shreya   22       la
2    charlie   34  chicago
3  shreyaaaa   21  Karachi

In [33]:
data={'NAME':['yahika','shreya','charlie','david'],
      'age':[25,22,34,35],
      'cty':['nyc','la','chicago','houston']
     }
df=pd.DataFrame(data)
print("initial df")
print(df)

#updating the column name

df=df.rename(columns ={'age':'marks'})
print(df)

#changing to lowercase of columne name

df.columns=df.columns.str.lower()
print(df)

initial df
      NAME  age      cty
0   yahika   25      nyc
1   shreya   22       la
2  charlie   34  chicago
3    david   35  houston
      NAME  marks      cty
0   yahika     25      nyc
1   shreya     22       la
2  charlie     34  chicago
3    david     35  houston
      name  marks      cty
0   yahika     25      nyc
1   shreya     22       la
2  charlie     34  chicago
3    david     35  houston

In [42]:
print("print the value at 2nd row")
print(df.loc[1])

print("value of marks in 3rd col")
print(df.loc[3,['marks']])

print the value at 2nd row
name     shreya
marks        22
cty          la
Name: 1, dtype: object
value of marks in 3rd col
marks    35
Name: 3, dtype: object

In [44]:
df.loc[df['marks']>25, 'Remarks']='very good'
df.loc[df['marks']<=25, 'Remarks']='okok'
print(df)

      name  marks      cty    Remarks
0   yahika     25      nyc       okok
1   shreya     22       la       okok
2  charlie     34  chicago  very good
3    david     35  houston  very good